app/controllers/users_controller.rb

  def create
    if @user.save
---
INSERT INTO `users` (`created_at`, `single_access_token`, `last_request_at`, `crypted_password`, `updated_at`, `perishable_token`, `failed_login_count`, `current_login_ip`, `openid_identifier`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('2010-05-16 19:01:23', 'HxlOfeZ1unpxmLYLPPng', '2010-05-16 19:01:23', '1eee47e1e18c844eafd228a7223741e226b753cc514d18dfad965d528f7e72fbd25c9580d7b40fa95b4874ed3aa9d5b89c5d5f2b4de7ba55859b54c5ced8fab3', '2010-05-16 19:01:23', '1HMCldKLENnpg8BtWPNH', 0, '127.0.0.1', NULL, 'KY5IH0hS61yvauBmto9k', '2010-05-16 19:01:23', 'f144973f6cebf04f10e37da62a0ace08766b5ab1127a9893186a3735e8ebd8f0497bcae628e508a3743f9a9138bae40fab5712f5dac4fc02347c435017569e10', 1, NULL, 'dtxbullet', NULL, 'davidbritton.ballard@gmail.com')